#!/bin/bash/

#Запросить у пользователя имя сетевого интерфейса и сохранить в переменную


#Запросить желаемый статический IP-адрес и сохранить в переменную

#Запросить маску подсети (или префикс) и сохранить в переменную

#Запросить IP-адрес шлюза (gateway) и сохранить в переменную

#Запросить DNS-серверы и сохранить в переменную

#Создать резервную копию текущего файла конфигурации сети

#Очистить содержимое конфигурационного файла или найти строки со старыми настройками

#Записать (вставить) новую конфигурацию в файл, подставив данные из переменных

#Применить новые настройки сети

#Проверить, применились ли настройки (например, пингом или выводом IP)